// Напишите программу, которая принимает на вход координаты двух точек
// и находит расстояние между ними в 3D пространстве.
// A(3,6,8); B(2,1,-7)->15.84

float x1, y1, z1;
Console.Write("Enter the x coordinates of the first point: ");
x1 = Convert.ToSingle(Console.ReadLine()); 
Console.Write("Enter the y coordinates of the first point: ");
y1 = Convert.ToSingle(Console.ReadLine());
Console.Write("Enter the z coordinates of the first point: ");
z1 = Convert.ToSingle(Console.ReadLine());

float x2, y2, z2;


